const { areasOfCountry, carriersOf, countryCodeOf } = require('../areasOfCountry')

const format = (cc, n) => `+${cc}(${n.toString().padStart(2, '0')})`

/* global process */
require('dotenv').config()
const HIDE_BANK_PAYMENT = process.env.HIDE_BANK_PAYMENT
const SELF_URL = process.env.SELF_URL
const FREE_LINKS = Number(process.env.FREE_LINKS)
const SUPPORT_USERNAME = process.env.SUPPORT_USERNAME

const HIDE_SMS_APP = process.env.HIDE_SMS_APP
const HIDE_BECOME_RESELLER = process.env.HIDE_BECOME_RESELLER
const TG_HANDLE = process.env.TG_HANDLE
const TG_CHANNEL = process.env.TG_CHANNEL
const SMS_APP_NAME = process.env.SMS_APP_NAME
const SMS_APP_LINK = process.env.SMS_APP_LINK
const CHAT_BOT_NAME = process.env.CHAT_BOT_NAME
const CHAT_BOT_BRAND = process.env.CHAT_BOT_BRAND
const SUPPORT_HANDLE = process.env.SUPPORT_HANDLE
const APP_SUPPORT_LINK = process.env.APP_SUPPORT_LINK

const PRICE_DAILY = Number(process.env.PRICE_DAILY_SUBSCRIPTION)
const PRICE_WEEKLY = Number(process.env.PRICE_WEEKLY_SUBSCRIPTION)
const PRICE_MONTHLY = Number(process.env.PRICE_MONTHLY_SUBSCRIPTION)
const DAILY_PLAN_FREE_DOMAINS = Number(process.env.DAILY_PLAN_FREE_DOMAINS)
const WEEKLY_PLAN_FREE_DOMAINS = Number(process.env.WEEKLY_PLAN_FREE_DOMAINS)
const FREE_LINKS_HOURS = Number(process.env.FREE_LINKS_TIME_SECONDS) / 60 / 60
const MONTHLY_PLAN_FREE_DOMAINS = Number(process.env.MONTHLY_PLAN_FREE_DOMAINS)

const HOSTING_STARTER_PLAN_PRICE = parseFloat(process.env.HOSTING_STARTER_PLAN_PRICE)
const HOSTING_PRO_PLAN_PRICE = parseFloat(process.env.HOSTING_PRO_PLAN_PRICE)
const HOSTING_BUSINESS_PLAN_PRICE = parseFloat(process.env.HOSTING_BUSINESS_PLAN_PRICE)
const VPS_HOURLY_PLAN_MINIMUM_AMOUNT_PAYABLE = parseFloat(process.env.VPS_HOURLY_PLAN_MINIMUM_AMOUNT_PAYABLE) || 50

const npl = {
  // New Zealand
  Spark: ['Spark'],
  Vocus: ['Vocus'],
  '2Degrees/Voyager': ['Voyager'],
  'Skinny Mobile': ['Skinny Mobile'],
  // Australia
  Telstra: ['Telstra'],
  Optus: ['Optus'],
  Vodafone: ['VODAFONE', 'Vodafone'],
  // UK
  EE: ['EE'],
  Three: ['Three'],
  'Virgin/O2': ['Virgin'],
}

const alcazar = {
  'T-mobile': ['T-MOBILE', 'OMNIPOINT', 'METROPCS', 'SPRINT', 'AERIAL'],
  'Metro PCS': ['T-MOBILE', 'OMNIPOINT', 'METROPCS', 'SPRINT', 'AERIAL'],
  Sprint: ['T-MOBILE', 'OMNIPOINT', 'METROPCS', 'SPRINT', 'AERIAL'],
  'Verizon Wireless': ['CELLCO', 'ONVOY'],
  'AT&T': ['CINGULAR'],
}

// Note: these button labels must not mix with each other, other wise it may mess up bot
const admin = {
  viewAnalytics: '📊 विश्लेषण देखें',
  viewUsers: '👀 उपयोगकर्ता देखें',
  blockUser: '✋ उपयोगकर्ता को ब्लॉक करें',
  unblockUser: '👌 उपयोगकर्ता को अनब्लॉक करें',
  messageUsers: '👋 सभी उपयोगकर्ताओं को संदेश भेजें',
}
const user = {
  // main keyboards
  cPanelWebHostingPlans: 'रूस cPanel होस्टिंग प्लान 🔒',
  pleskWebHostingPlans: 'रूस Plesk होस्टिंग प्लान ',
  joinChannel: '📢 चैनल जॉइन करें',
  phoneNumberLeads: '📲 HQ एसएमएस लीड',
  hostingDomainsRedirect: '🌐 होस्टिंग और डोमेन',
  wallet: '👛 मेरा वॉलेट',
  urlShortenerMain: '🔗✂️ URL छोटा करें',
  vpsPlans: 'बुलेटप्रूफ VPS🛡️ खरीदें - प्रति घंटा/मासिक',
  buyPlan: '🔔 यहां सब्सक्राइब करें',
  domainNames: '🌐 डोमेन नाम पंजीकृत करें - ❌ DMCA',
  viewPlan: '🔔 मेरा प्लान',
  becomeReseller: '💼 पुनर्विक्रेता बनें',
  getSupport: '💬 सहायता प्राप्त करें',
  freeTrialAvailable: '📧🆓 BulkSMS - फ्री ट्रायल',
  changeSetting: '🌍 सेटिंग्स बदलें',

  // Sub Menu 1: urlShortenerMain
  redSelectUrl: '🔀✂️ रीडायरेक्ट और छोटा करें',
  urlShortener: '✂️🌐 कस्टम डोमेन शॉर्टनर',
  viewShortLinks: '📊 शॉर्टलिंक एनालिटिक्स देखें',

  // Sub Menu 2: domainNames
  buyDomainName: '🛒🌐 डोमेन नाम खरीदें',
  viewDomainNames: '📂 मेरे डोमेन नाम',
  dnsManagement: '🔧 DNS प्रबंधन',

  // Sub Menu 3: cPanel/Plesk WebHostingPlansMain
  freeTrial: '💡 फ्री ट्रायल',
  starterPlan: '🔼 स्टार्टर प्लान',
  proPlan: '🔷 प्रो प्लान',
  businessPlan: '👑 बिज़नेस प्लान',
  contactSupport: '📞 समर्थन से संपर्क करें',

  // Sub Menu 4: VPS Plans
  buyVpsPlan: '⚙️ नया VPS बनाएँ',
  manageVpsPlan: '🖥️ VPS देखें/प्रबंधित करें',
  manageVpsSSH: '🔑 SSH कुंजी',

  // Free Trial
  freeTrialMenuButton: '🚀 फ्री ट्रायल (12 घंटे)',
  getFreeTrialPlanNow: '🛒 अभी ट्रायल प्लान प्राप्त करें',
  continueWithDomainNameSBS: websiteName => `➡️ ${websiteName} के साथ जारी रखें`,
  searchAnotherDomain: '🔍 दूसरा डोमेन खोजें',
  privHostNS: '🏢 PrivHost (तेज़ और सुरक्षित होस्टिंग)',
  cloudflareNS: '🛡️ Cloudflare शील्ड (सुरक्षा और गुप्तता)',
  backToFreeTrial: '⬅️ फ्री ट्रायल पर वापस जाएं',

  // Paid Plans
  buyStarterPlan: '🛒 स्टार्टर प्लान खरीदें',
  buyProPlan: '🛒 प्रो प्लान खरीदें',
  buyBusinessPlan: '🛒 बिज़नेस प्लान खरीदें',
  viewStarterPlan: '🔷 स्टार्टर प्लान देखें',
  viewProPlan: '🔼 प्रो प्लान देखें',
  viewBusinessPlan: '👑 बिज़नेस प्लान देखें',
  backToHostingPlans: '⬅️ होस्टिंग प्लान्स पर वापस जाएं',
  registerANewDomain: '🌐 नया डोमेन पंजीकृत करें',
  useExistingDomain: '🔄 मौजूदा डोमेन का उपयोग करें',
  backToStarterPlanDetails: '⬅️ स्टार्टर प्लान विवरण पर वापस जाएं',
  backToProPlanDetails: '⬅️ प्रो प्लान विवरण पर वापस जाएं',
  backToBusinessPlanDetails: '⬅️ बिज़नेस प्लान विवरण पर वापस जाएं',
  continueWithDomain: websiteName => `➡️ ${websiteName} के साथ जारी रखें`,
  enterAnotherDomain: '🔍 दूसरा डोमेन दर्ज करें',
  backToPurchaseOptions: '⬅️ खरीद विकल्पों पर वापस जाएं',
}

const u = {
  // other key boards
  deposit: '➕💵 जमा',
  withdraw: '➖💵 वापस लें',

  // wallet
  usd: 'USD',
  ngn: 'NGN',
}
const view = num => Number(num).toFixed(2)
const yesNo = ['हाँ', 'नहीं']

const bal = (usd, ngn) =>
  HIDE_BANK_PAYMENT !== 'true'
    ? `$${view(usd)}
₦${view(ngn)}`
    : `$${view(usd)}`

const dnsEntryFormat = `रिकॉर्ड प्रारूप:
        •       A रिकॉर्ड (वेबसाइट के लिए अनिवार्य) / CNAME (वैकल्पिक, A रिकॉर्ड के साथ सह-अस्तित्व नहीं रख सकता)
        •       होस्ट नाम: उपडोमेन (उदा. : auth) या रूट के लिए '@' (वैकल्पिक)
        •       मान: A के लिए IP पता / CNAME के लिए होस्टनाम

कृपया नीचे दिए गए प्रारूप का उपयोग करके अपना रिकॉर्ड दर्ज करें:

उदाहरण:
✅ A रिकॉर्ड: A pay 192.0.2.1 (या A 192.0.2.1 यदि कोई होस्ट नाम नहीं है)
✅ CNAME रिकॉर्ड: CNAME pay 0oaawzt7.up.railway.app (या CNAME 0oaawzt7.up.railway.app यदि कोई होस्ट नाम नहीं है)`

const t = {
  yes: 'हाँ',
  no: 'नहीं',
  back: 'वापस',
  cancel: 'रद्द करें',
  skip: 'छोड़ें',
  becomeReseller: `नमस्ते,

मैं आपको ${CHAT_BOT_BRAND}Bot के शक्तिशाली एसएमएस मार्केटिंग और होस्टिंग सॉफ़्टवेयर का पुनर्विक्रेता बनने का एक शानदार अवसर प्रदान करने के लिए संपर्क कर रहा हूँ।

मुख्य विवरण:

लाभ साझेदारी: प्रत्येक बिक्री पर 65/35% का प्रतिस्पर्धी हिस्सा कमाएं।

सेट-अप शुल्क: विवरण के लिए समर्थन से संपर्क करें।

रुचि है? इस लाभदायक साझेदारी के बारे में अधिक जानने के लिए ${SUPPORT_HANDLE} पर हमसे संपर्क करें।

आपके साथ संभावित सहयोग की प्रतीक्षा है!

शुभकामनाएँ,

${CHAT_BOT_BRAND} टीम
`,
  resetLoginAdmit: `${CHAT_BOT_BRAND} एसएमएस: आप अपने पिछले डिवाइस से सफलतापूर्वक लॉग आउट हो गए हैं। कृपया अब लॉग इन करें।`,
  resetLoginDeny: 'ठीक है, कोई और कार्रवाई की आवश्यकता नहीं है।',
  resetLogin: `${CHAT_BOT_BRAND} एसएमएस: क्या आप अपने पिछले डिवाइस से लॉग आउट करने की कोशिश कर रहे हैं?`,
  select: `कृपया एक विकल्प चुनें:`,

  // cPanel/Plesk Plans initial select plan text
  selectPlan: `कृपया एक योजना चुनें:`,
  backButton: '⬅️ वापस',
  yesProceedWithThisEmail: email => `➡️ ${email} के साथ आगे बढ़ें`,
  proceedWithPayment: '➡️ भुगतान के साथ आगे बढ़ें',
  iHaveSentThePayment: `मैंने भुगतान भेज दिया है ✅`,
  trialAlreadyUsed: `आपने पहले ही अपना मुफ्त ट्रायल उपयोग कर लिया है। यदि आपको अधिक पहुंच की आवश्यकता है, तो कृपया हमारे किसी भुगतान वाले योजना की सदस्यता लेने पर विचार करें।`,
  oneHourLeftToExpireTrialPlan: `आपकी Freedom योजना 1 घंटे में समाप्त होने वाली है। यदि आप हमारी सेवाओं का उपयोग जारी रखना चाहते हैं, तो भुगतान योजना में अपग्रेड करने पर विचार करें!`,
  freePlanExpired: `🚫 आपकी Freedom योजना समाप्त हो गई है। हमें उम्मीद है कि आपने अपना ट्रायल पसंद किया होगा। हमारी सेवाओं का उपयोग जारी रखने के लिए, कृपया हमारे प्रीमियम योजनाओं में से एक खरीदें।`,
  freeTrialPlanSelected: hostingType => `
- हमारे <b>Freedom योजना</b> को निःशुल्क आज़माएं! इस योजना में एक निःशुल्क डोमेन शामिल है, जिसका अंत .sbs पर होता है और यह 12 घंटे के लिए सक्रिय रहेगा।

🚀 <b>Freedom योजना:</b>
<b>- स्टोरेज:</b> 1 GB SSD
<b>- बैंडविड्थ:</b> 10 GB
<b>- डोमेन:</b> 1 निःशुल्क .sbs डोमेन
<b>- ईमेल खाते:</b> 1 ईमेल खाता
<b>- डेटाबेस:</b> 1 MySQL डेटाबेस
<b>- मुफ्त SSL:</b> हां
<b>- ${hostingType} सुविधाएँ:</b> ${hostingType} के लिए फ़ाइलें, डेटाबेस और ईमेल प्रबंधित करने हेतु पूर्ण पहुंच।
<b>- अवधि:</b> 12 घंटे तक सक्रिय
<b>- आदर्श उपयोग:</b> परीक्षण और लघुकालीन परियोजनाओं के लिए।
  `,

  getFreeTrialPlan: `कृपया अपनी इच्छित डोमेन नाम (उदा., example.sbs) दर्ज करें और इसे संदेश के रूप में भेजें। यह डोमेन .sbs में समाप्त होगा और आपके ट्रायल प्लान के साथ मुफ्त है।`,
  trialPlanContinueWithDomainNameSBSMatched: websiteName => `डोमेन ${websiteName} उपलब्ध है!`,
  trialPlanSBSDomainNotMatched: `आपके द्वारा दर्ज किया गया डोमेन नहीं मिला। कृपया सही डोमेन सुनिश्चित करें या किसी अन्य का उपयोग करें।`,
  trialPlanSBSDomainIsPremium: `डोमेन प्रीमियम मूल्य पर है और केवल भुगतान योजना के साथ उपलब्ध है। कृपया अन्य डोमेन खोजें।`,
  trialPlanGetNowInvalidDomain: `कृपया एक मान्य डोमेन नाम दर्ज करें जो '.sbs' पर समाप्त होता है। डोमेन 'example.sbs' जैसा दिखना चाहिए और आपके ट्रायल प्लान के साथ मुफ्त है।`,
  trialPlanNameserverSelection: websiteName => `कृपया ${websiteName} के लिए उपयोग करने के लिए नाम सर्वर प्रदाता चुनें।`,
  trialPlanDomainNameMatched: `कृपया अपना खाता बनाने और अपनी रसीद भेजने के लिए अपना ईमेल पता प्रदान करें।`,
  confirmEmailBeforeProceedingSBS: email =>
    `क्या आप निश्चित हैं कि आप इस ${email} ईमेल के साथ Freedom योजना सदस्यता के लिए आगे बढ़ना चाहते हैं?`,
  trialPlanInValidEmail: `कृपया एक मान्य ईमेल प्रदान करें।`,
  trialPlanActivationConfirmation: `धन्यवाद! आपका मुफ्त ट्रायल प्लान जल्द ही सक्रिय होगा। कृपया ध्यान दें, यह योजना केवल 12 घंटे के लिए सक्रिय रहेगी।`,
  trialPlanActivationInProgress: `आपका मुफ्त ट्रायल प्लान सक्रिय हो रहा है। इसमें कुछ क्षण लग सकते हैं...`,

  what: `कृपया कीबोर्ड से विकल्प चुनें।`,
  whatNum: `कृपया एक मान्य संख्या चुनें।`,
  phoneGenTimeout: `समय समाप्त।`,
  phoneGenNoGoodHits: `कृपया समर्थन से संपर्क करें ${SUPPORT_HANDLE} या किसी अन्य क्षेत्र कोड का चयन करें।`,

  subscribeRCS: p =>
    `सदस्यता ली गई! ${p} पर क्लिक करके कभी भी <a href="${SELF_URL}/unsubscribe?a=b&Phone=${p}">लिंक</a> से सदस्यता समाप्त करें।`,
  unsubscribeRCS: p =>
    `आपने सदस्यता समाप्त कर दी है! पुनः सदस्यता लेने के लिए <a href="${SELF_URL}/subscribe?a=b&Phone=${p}">लिंक</a> पर क्लिक करें।`,
  argsErr: `डिव: गलत तर्क भेजे गए।`,
  showDepositNgnInfo:
    ngn => `कृपया नीचे "भुगतान करें" पर क्लिक करके ${ngn} NGN भेजें। एक बार लेन-देन की पुष्टि हो जाने पर, आपको तुरंत सूचित किया जाएगा और आपका वॉलेट अपडेट कर दिया जाएगा।

सादर,  
${CHAT_BOT_NAME}`,
  askEmail: `कृपया भुगतान पुष्टि के लिए एक ईमेल प्रदान करें।`,
  askValidAmount: 'कृपया एक मान्य संख्या प्रदान करें।',
  askValidEmail: 'कृपया एक मान्य ईमेल प्रदान करें।',
  askValidCrypto: 'कृपया एक मान्य क्रिप्टो करेंसी चुनें।',
  askValidPayOption: 'कृपया एक मान्य भुगतान विकल्प चुनें।',
  chooseSubscription:
    HIDE_SMS_APP === 'true'
      ? `<b>हमारी सब्सक्रिप्शन योजनाओं के साथ अपनी ब्रांड को बढ़ावा दें!</b>

- <b>दैनिक:</b> $${PRICE_DAILY} — ${DAILY_PLAN_FREE_DOMAINS} मुफ्त ".sbs/.xyz" डोमेन + ${DAILY_PLAN_FREE_VALIDATIONS.toLocaleString()} मुफ्त USA फोन वैलिडेशन।
- <b>साप्ताहिक:</b> $${PRICE_WEEKLY} — ${WEEKLY_PLAN_FREE_DOMAINS} मुफ्त ".sbs/.xyz" डोमेन + ${WEEKLY_PLAN_FREE_VALIDATIONS.toLocaleString()} मुफ्त USA फोन वैलिडेशन।
- <b>मासिक:</b> $${PRICE_MONTHLY} — ${MONTHLY_PLAN_FREE_DOMAINS} मुफ्त ".sbs/.xyz" डोमेन + ${MONTHLY_PLAN_FREE_VALIDATIONS.toLocaleString()} मुफ्त USA फोन वैलिडेशन।

(मुफ्त डोमेन ".sbs" और ".xyz" एक्सटेंशन के लिए।)`
      : `<b>हमारी सब्सक्रिप्शन योजनाओं के साथ अपनी ब्रांड को बढ़ावा दें!</b>

- <b>दैनिक:</b> $${PRICE_DAILY} — ${DAILY_PLAN_FREE_DOMAINS} मुफ्त ".sbs/.xyz" डोमेन + ${DAILY_PLAN_FREE_VALIDATIONS.toLocaleString()} मुफ्त USA फोन वैलिडेशन + असीमित BulkSMS।
- <b>साप्ताहिक:</b> $${PRICE_WEEKLY} — ${WEEKLY_PLAN_FREE_DOMAINS} मुफ्त ".sbs/.xyz" डोमेन + ${WEEKLY_PLAN_FREE_VALIDATIONS.toLocaleString()} मुफ्त USA फोन वैलिडेशन + असीमित BulkSMS।
- <b>मासिक:</b> $${PRICE_MONTHLY} — ${MONTHLY_PLAN_FREE_DOMAINS} मुफ्त ".sbs/.xyz" डोमेन + ${MONTHLY_PLAN_FREE_VALIDATIONS.toLocaleString()} मुफ्त USA फोन वैलिडेशन + असीमित BulkSMS।

(मुफ्त डोमेन ".sbs" और ".xyz" एक्सटेंशन के लिए।)`,

  askCoupon: usd =>
    `मूल्य $${usd} है। क्या आप कूपन कोड लगाना चाहेंगे? यदि आपके पास है, तो कृपया इसे अभी दर्ज करें। अन्यथा, "स्किप" पर क्लिक करें।`,
  planAskCoupon: `क्या आप कूपन कोड लगाना चाहेंगे? यदि आपके पास है, तो कृपया इसे अभी दर्ज करें। अन्यथा, "स्किप" पर क्लिक करें।`,
  enterCoupon: `कृपया एक कूपन कोड दर्ज करें:`,
  planPrice: (plan, price) => `${plan} सब्सक्रिप्शन की कीमत $${price} है। कृपया भुगतान विधि चुनें।`,
  planNewPrice: (plan, price, newPrice) =>
    `${plan} सब्सक्रिप्शन की कीमत अब $${view(newPrice)} <s>($${price})</s> है। कृपया भुगतान विधि चुनें।`,
  domainPrice: (domain, price) => `${domain} डोमेन की कीमत $${price} USD है। भुगतान विधि चुनें।`,
  domainNewPrice: (domain, price, newPrice) =>
    `${domain} डोमेन की कीमत अब $${view(newPrice)} <s>($${price})</s> है। भुगतान विधि चुनें।`,
  couponInvalid: `अमान्य कूपन कोड। कृपया पुनः कूपन कोड दर्ज करें:`,
  lowPrice: `भेजी गई कीमत आवश्यक से कम है।`,
  freeTrialAvailable: `आपका BulkSMS नि:शुल्क परीक्षण अब सक्षम है। कृपया ${SMS_APP_LINK} पर ${SMS_APP_NAME} Android ऐप डाउनलोड करें। क्या आपको ई-सिम कार्ड की ज़रूरत है? ${SUPPORT_HANDLE} से संपर्क करें।`,
  freeTrialNotAvailable: `आप पहले ही नि:शुल्क परीक्षण का उपयोग कर चुके हैं।`,
  planSubscribed:
    HIDE_SMS_APP === 'true'
      ? `आपने {{plan}} प्लान को सफलतापूर्वक सब्सक्राइब कर लिया है! मुफ्त ".sbs/.xyz" डोमेन और मुफ्त USA फोन वैलिडेशन का आनंद लें। E-sim चाहिए? ${SUPPORT_HANDLE} से संपर्क करें।`
      : `आपने {{plan}} प्लान को सफलतापूर्वक सब्सक्राइब कर लिया है! मुफ्त ".sbs/.xyz" डोमेन, मुफ्त USA वैलिडेशन और ${SMS_APP_NAME} का आनंद लें। अप्लिकेशन यहाँ डाउनलोड करें: ${SMS_APP_LINK}। E-sim चाहिए? ${SUPPORT_HANDLE} से संपर्क करें।`,
  alreadySubscribedPlan: days => `आपकी सदस्यता सक्रिय है और ${days} दिनों में समाप्त होगी।`,
  payError: `भुगतान सत्र नहीं मिला। कृपया पुनः प्रयास करें या सहायता ${SUPPORT_USERNAME} से संपर्क करें। अधिक जानकारी ${TG_HANDLE} पर प्राप्त करें।`,
  chooseFreeDomainText: `<b>शानदार खबर!</b> यह डोमेन आपके सब्सक्रिप्शन के साथ मुफ्त में उपलब्ध है। क्या आप इसे दावा करना चाहेंगे?`,

  chooseDomainToBuy: text =>
    `<b>वेबसाइट का हिस्सा बनाएं!</b> कृपया वह डोमेन नाम साझा करें जिसे आप खरीदना चाहते हैं, जैसे कि "abcpay.com". ${text}`,
  askDomainToUseWithShortener: `क्या आप इस डोमेन के साथ संक्षेपण उपयोग करना चाहते हैं?`,
  blockUser: `कृपया उस उपयोगकर्ता का उपयोगकर्ता नाम साझा करें जिसे ब्लॉक करना है।`,
  unblockUser: `कृपया उस उपयोगकर्ता का उपयोगकर्ता नाम साझा करें जिसे अनब्लॉक करना है।`,
  blockedUser: `आप फिलहाल बॉट के उपयोग से अवरुद्ध हैं। कृपया सहायता से संपर्क करें ${SUPPORT_USERNAME}. ${TG_HANDLE} पर अधिक जानें।`,
  greet: `इस स्थान पर नजर रखें! हम URL संक्षेपण एप्लिकेशन को लॉन्च करने की तैयारी कर रहे हैं जो आपके लिंक को छोटा, मीठा और सीधे होगा। हमारी बड़ी प्रकटता के लिए प्रतीक्षा करें।

सहायता ${SUPPORT_USERNAME} पर Telegram में है।`,
  linkExpired: `${CHAT_BOT_BRAND} परीक्षण समाप्त हो गया है और आपका संक्षेपित लिंक निष्क्रिय हो गया है। हम URL सेवा और मुफ्त डोमेन नामों तक पहुंच बनाए रखने के लिए सब्सक्राइब करने के लिए आमंत्रित करते हैं। उपयुक्त योजना चुनें और सब्सक्राइब करने के निर्देशों का पालन करें। किसी भी प्रश्न के लिए हमें संपर्क करें।
सादर,
${CHAT_BOT_BRAND} टीम
${TG_CHANNEL} पर अधिक जानें।`,
  successPayment: `भुगतान सफलतापूर्वक संसाधित हो गया! इस विंडो को अब बंद करें।`,
  welcome: `${CHAT_BOT_NAME} को चुनने के लिए धन्यवाद! कृपया नीचे एक विकल्प चुनें :`,
  welcomeFreeTrial: `${CHAT_BOT_BRAND} में आपका स्वागत है! URL शॉर्टनिंग सभी के लिए मुफ्त है। मुफ्त ".sbs/.xyz" डोमेन और मुफ्त USA फोन वैलिडेशन के लिए सब्सक्राइब करें। ${CHAT_BOT_BRAND} का अनुभव करें!`,
